filestore/fourjobs-3drives/rw-1M.out
ceph-fuse: (g=0): rw=rw, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
...
ceph-kernel: (g=1): rw=rw, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
...
fio-2.16
Starting 8 processes

ceph-fuse: (groupid=0, jobs=4): err= 0: pid=27674: Tue Feb 27 20:42:48 2018
  read : io=2006.0MB, bw=33866KB/s, iops=33, runt= 60655msec
    slat (msec): min=17, max=43, avg=24.56, stdev= 3.71
    clat (msec): min=714, max=3111, avg=1892.87, stdev=421.84
     lat (msec): min=732, max=3140, avg=1917.44, stdev=421.10
    clat percentiles (msec):
     |  1.00th=[ 1106],  5.00th=[ 1221], 10.00th=[ 1319], 20.00th=[ 1500],
     | 30.00th=[ 1663], 40.00th=[ 1795], 50.00th=[ 1893], 60.00th=[ 1991],
     | 70.00th=[ 2114], 80.00th=[ 2245], 90.00th=[ 2442], 95.00th=[ 2606],
     | 99.00th=[ 2933], 99.50th=[ 2966], 99.90th=[ 3032], 99.95th=[ 3064],
     | 99.99th=[ 3097]
    bw (KB  /s): min= 3065, max=26340, per=23.46%, avg=7943.38, stdev=4341.44
  write: io=1931.0MB, bw=32600KB/s, iops=31, runt= 60655msec
    slat (msec): min=36, max=825, avg=100.03, stdev=103.57
    clat (usec): min=15, max=3140.4K, avg=1889531.84, stdev=438195.42
     lat (msec): min=712, max=3231, avg=1989.56, stdev=438.82
    clat percentiles (msec):
     |  1.00th=[ 1057],  5.00th=[ 1205], 10.00th=[ 1303], 20.00th=[ 1500],
     | 30.00th=[ 1663], 40.00th=[ 1795], 50.00th=[ 1893], 60.00th=[ 1991],
     | 70.00th=[ 2114], 80.00th=[ 2245], 90.00th=[ 2474], 95.00th=[ 2638],
     | 99.00th=[ 2933], 99.50th=[ 2966], 99.90th=[ 3097], 99.95th=[ 3130],
     | 99.99th=[ 3130]
    bw (KB  /s): min= 3065, max=22055, per=23.78%, avg=7752.16, stdev=4095.03
    lat (usec) : 20=0.10%
    lat (msec) : 750=0.08%, 1000=0.33%, 2000=60.60%, >=2000=38.89%
  cpu          : usr=0.19%, sys=0.59%, ctx=33447, majf=0, minf=97
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=0.8%, 16=1.6%, 32=96.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=2006/w=1931/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kernel: (groupid=1, jobs=4): err= 0: pid=27719: Tue Feb 27 20:42:48 2018
  read : io=2524.0MB, bw=41992KB/s, iops=41, runt= 61549msec
    slat (usec): min=33, max=4191, avg=192.86, stdev=310.33
    clat (msec): min=10, max=9260, avg=730.87, stdev=1241.57
     lat (msec): min=10, max=9260, avg=731.06, stdev=1241.57
    clat percentiles (msec):
     |  1.00th=[   11],  5.00th=[   20], 10.00th=[   28], 20.00th=[   49],
     | 30.00th=[   82], 40.00th=[  129], 50.00th=[  215], 60.00th=[  355],
     | 70.00th=[  668], 80.00th=[ 1057], 90.00th=[ 2008], 95.00th=[ 3392],
     | 99.00th=[ 6390], 99.50th=[ 7308], 99.90th=[ 9241], 99.95th=[ 9241],
     | 99.99th=[ 9241]
    bw (KB  /s): min= 4079, max=90112, per=47.85%, avg=20093.66, stdev=13955.93
  write: io=2527.0MB, bw=42042KB/s, iops=41, runt= 61549msec
    slat (usec): min=96, max=11172, avg=699.36, stdev=587.40
    clat (msec): min=56, max=10005, avg=2381.02, stdev=1709.36
     lat (msec): min=57, max=10005, avg=2381.72, stdev=1709.42
    clat percentiles (msec):
     |  1.00th=[  338],  5.00th=[  709], 10.00th=[  865], 20.00th=[ 1037],
     | 30.00th=[ 1336], 40.00th=[ 1680], 50.00th=[ 1893], 60.00th=[ 2245],
     | 70.00th=[ 2671], 80.00th=[ 3326], 90.00th=[ 4424], 95.00th=[ 6783],
     | 99.00th=[ 8160], 99.50th=[ 8455], 99.90th=[ 9765], 99.95th=[ 9765],
     | 99.99th=[10028]
    bw (KB  /s): min= 4079, max=69632, per=44.56%, avg=18735.70, stdev=12434.94
    lat (msec) : 20=2.77%, 50=7.52%, 100=6.95%, 250=9.64%, 500=6.75%
    lat (msec) : 750=5.86%, 1000=8.97%, 2000=23.04%, >=2000=28.49%
  cpu          : usr=0.11%, sys=0.40%, ctx=6567, majf=0, minf=95
  IO depths    : 1=0.1%, 2=0.2%, 4=0.3%, 8=0.6%, 16=1.3%, 32=97.5%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=2524/w=2527/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: io=2006.0MB, aggrb=33866KB/s, minb=33866KB/s, maxb=33866KB/s, mint=60655msec, maxt=60655msec
  WRITE: io=1931.0MB, aggrb=32599KB/s, minb=32599KB/s, maxb=32599KB/s, mint=60655msec, maxt=60655msec

Run status group 1 (all jobs):
   READ: io=2524.0MB, aggrb=41992KB/s, minb=41992KB/s, maxb=41992KB/s, mint=61549msec, maxt=61549msec
  WRITE: io=2527.0MB, aggrb=42042KB/s, minb=42042KB/s, maxb=42042KB/s, mint=61549msec, maxt=61549msec